/**
 * @fileoverview Статичні дані, текстовки, конфіги.
 * @version 1.1.3
 * @dependencies ApexCharts, IndexedDB
 */
const Data = {};

/**
 * Текстовки та локалізація
 */
Data.text = {
    // Категорії
    'Обстріли': 'Обстріли',
    'РУ': 'РУ',
    'Ракетні удари': 'Ракетні удари',
    'Ракет': 'Застосовано ракет',
    'АУ/КАБ/КАР': 'АУ/КАБ/КАР',
    'АУ_': 'АУ',
    'КАБ': 'КАБ',
    'КАР': 'КАР',
    'ШД': 'Штурмові дії',
    'Втрата позицій': 'Втрата позицій',
    'Позиції': 'Позиції',
    'Території': 'Території',
    'Території в/в': 'Втрачені та відновлені території',
    'втрачено': 'Втрачено',
    'відновлено': 'Відновлено',
    'втрачено_територій': 'Втрачено території',
    'відновлено_територій': 'Відновлено території',
    'відновлено_територій_сумарно':'Відновлено за рік',
    'втрати_територій_сумарно':'Втрачено за рік',
    'Втрати ос': 'Втрати о/с',
    'Втрати_всього_ЗСУ': 'Втрати о/с ЗСУ',
    'Втрати_всього_рф': 'Втрати о/с противника',
    'БпС противника': 'БпC противника',
    'позиції в/в': 'Відновлені та виставлені позиції',
    'Відновлено_позицій': 'Відновлено позицій',
    'Виставлено_позицій': 'Виставлено позицій',
    'fpv': 'Застосування FPV',

    'за рік': 'За рік',
    'за період': 'За обраний період',

    'втрати середньодобові':'Середньодобові втрати о.с. за обраний період',
    'втрати безповоротні':'Безповоротні втрати',
    'втрати санітарні':'Санітарні втрати',
    'втрати полон':'Полонені',
    'втрати зниклі': 'Зниклі безвісті',

    'втрати за період': 'За період',
    'втрати з початку року':'З початку року',
    'втрати з початку наступу':'З початку повномасштабного вторгнення',
    'втрати всього':'Всього',


    'friendly':'Свої',
    'enemy': 'Противник',
    'operations':'Оперативний облік СОУ',
    'personel': 'Облік персоналу СОУ',

    'Average': 'Середнє',

    DashBoard: {
        
    },
    OVgP: {
        categoriesByHeader: {
            // 'ствольний важкі': 'Більше 155 мм',
            // 'ствольний середні': 'більше 105 мм, до 155 мм',
            // 'ствольний легкі': 'до 105 мм (включно)',
            'ствольний середній протитанковий': '(високоточні): більше 105 мм до 155 мм включно',
            'ствольний середній касетний': '(касетні):  більше 105 мм до 155 мм включно',
            'ствольний середній дистанційне мінування': '(Д/М): більше 105 мм до 155 мм включно',
            'ствольний важкий ОФ': '(ОФ): більше 155 мм',
            'ствольний середній ОФ': '(ОФ): більше 105 мм до 155 мм включно',
            'ствольний легкий ОФ': '(ОФ): до 105 мм включно',
            'РСЗВ важкий дистанційне мінування': '(Д/М): 220 мм і більше',

            'Міномети важкі': '120 мм і більше',
            'Міномети середні': 'від 82 мм до 120 мм виключно',
            'Міномети легкі': 'до 82 мм виключно',
            'РСЗВ важкі': '220 мм і більше',
            'РСЗВ середні': 'від 122 до 220 мм виключно',
            'РСЗВ легкі': 'до 122 мм виключно',
            'Ракети балістичні': 'Балістичні',
            'Ракети крилаті': 'Крилаті',
            'Протитанкові важкі': 'Більше 155 мм',
            'Протитанкові середні': 'більше 105 мм до 155 мм включно',
            'Протитанкові легкі': 'до 105 мм включно',
            'Касетні важкі': 'більше 155 мм',
            'Касетні середні': 'більше 105 мм до 155 мм включно',
            'Касетні легкі': 'до 105 мм включно',
            'Дистанційне мінування': 'Дистанційне мінування',
        },
    },

    // Підрозділи
    'uvWest': 'УВ (с) Зх',
    'uvEast': 'УВ (с) Сх',
    'uvNorth': 'УВ (с) Пн',
    'uvSouth': 'УВ (с) Пд',
    'uOS': 'УОС',
    'uvKursk': 'УВ Курськ',
    'sbu': 'СБУ',
    'uSbps': 'УСБпС',
    '12AK': '12АК',

    // Titles
    'corelation': 'Співвідношення',
    'general info': 'Загальна інформація', // Виправлено одрук з genersl info
    'logo': 'Генеральний штаб <br/> Збройних Сил України',

    // Кнопки
    'detail': 'Деталі',

    // Фрази
    'wd': 'день війни',
};

/**
 * Глобальні змінні, базові конфіги
 */
Data.global = {
    //==========================
    // DataBase (IndexedDB)
    //==========================
    dbVersion: 1,

    dbModels: {
        'ГОЧ': [
            'Дата',
            'Угруповання',
            'Всього_бойових_зіткнень',
            'Бойові_зіткнення',
            'Тривають_бз',
            'Штурмові_дії_',
            'Тривають_шд',
            'Ракетні_удари',
            'Застосовано_ракет',
            'АУ_',
            'КАБ',
            'КАР',
            'ВСЬОГО_УДАРІВ_БпЛА',
            'ШахедиГербераПародія',
            'Італмас',
            'Ланцет',
            'Молнія',
            'Бандероль',
            'ПривітКуб',
            'FPVдрони',
            'Обстріли',
            'Всього_втрачено_позицій',
            'Знищено',
            '_Внаслідок_ШД',
            'сам_зал_позиції',
            'Всього_відновленовиставлено_позицій',
            'Відновлено_позицій',
            'Виставлено_позицій',
            'безповоротні_ЗСУ',
            'санітарні_ЗСУ',
            'зниклі_безвісті_ЗСУ',
            'полон_ЗСУ',
            'Втрати_всього_ЗСУ',
            'безповоротні_рф',
            'санітарні_рф',
            'полон_рф',
            'Втрати_всього_рф',
            'безповоротні_рік_ЗСУ',
            'санітарні_рік_ЗСУ',
            'зниклі_безвісті_рік_ЗСУ',
            'полон_рік_ЗСУ',
            'Втрати_всього_рік_ЗСУ',
            'безповоротні_рік_рф',
            'санітарні_рік_рф',
            'полон_рік_рф',
            'Втрати_всього_рік_рф',
            'безповоротні_всього_рф',
            'санітарні_всього_рф',
            'полон_всього_рф',
            'Втрати_всього_всього_рф',
            'втрачено_територій',
            'відновлено_територій',
            'втрачені_нп',
            'відновлені_нп',
            'втрати_територій_сумарно',
            'відновлено_територій_сумарно',
            'втрачені_нп_опис',
            'відновлені_нп_опис'
        ],
        'Застосування БК та FPV': [
            'Дата',
            'Противник_БК',
            'Наші_війська_БК',
            'Противник_FPV',
            'Наші_війська_FPV',
        ],
        'Втрати ЗСУ': [
            'Дата',
            'ВСЬОГО_за_СО:',
            'безповоротні_доба',
            'санітарні_доба',
            'полон_доба',
            'зниклі_безвісті_доба',
            'ВСЬОГО_доба',
            'безповоротні_рік',
            'санітарні_рік',
            'полон_рік',
            'зниклі_безвісті_рік',
            'ВСЬОГО_рік',
            'безповоротні_всього',
            'санітарні_всього',
            'полон_всього',
            'зниклі_безвісті_всього',
            'ВСЬОГО_всього'
        ],
        'ОВгП': [
            'Дата',
            'Угруповання',
            'РСЗВ_вз',
            'ствольний_вз',
            'ракета_вз',
            'мінометний_вз',
            'РСЗВ_важкий_вз',
            'РСЗВ_важкий_дистанційне_мінування_вз',
            'ствольний_середній_протитанковий_вз',
            'ракета_балістична_вз',
            'ракета_крилата_вз',
            'ствольний_середній_касетний_вз',
            'ствольний_середній_дистанційне_мінування_вз',
            'РСЗВ_середній_вз',
            'РСЗВ_легкий_вз',
            'ствольний_важкий_ОФ_вз',
            'ствольний_середній_ОФ_вз',
            'ствольний_легкий_ОФ_вз',
            'мінометний_важкий_вз',
            'мінометний_середній_вз',
            'мінометний_легкий_вз',
            '_227_мм_М30_вз',
            '_227_мм_М30А1А2_вз',
            '_227_мм_М31А1А2_вз',
            '_227_мм_GLSDB_вз',
            '_227_мм_DM72_вз',
            'М982_Excalibur_вз',
            '_610_мм_М39_вз',
            '_610_мм_М48_вз',
            '_610_мм_М57_вз',
            'Р360_Нептун_вз',
            '_155_мм_Bonus_вз',
            '_155_мм_Vulcano_вз',
            '_155_мм_Smart_вз',
            '_155_мм_Coperhed_вз',
            '_155_мм_М864_касетні_вз',
            '_155_мм_М483_касетні_вз',
            '_155_мм_М741_ДМ_вз',
            '_155_мм_М692_ДМ_вз',
            '_155_мм_М731_ДМ_вз',
            '_300_мм__РС_вз',
            '_220_мм_РС_вз',
            '_128_мм_РС_вз',
            '_122_мм_РС_вз',
            '_70_мм_РС_вз',
            '_203_мм_вз',
            '_155_мм_вз',
            '_152_мм_вз',
            '_122_мм_вз',
            '_105_мм_вз',
            '_100_мм_вз',
            '_85_мм_вз',
            '_120_мм_міномети_вз',
            '_82_мм_міномети_вз',
            '_60_мм_міномети_вз',
            '_227_мм_М26_вз',
            'РСЗВ_бп',
            'ствольний_бп',
            'ракета_бп',
            'мінометний_бп',
            'РСЗВ_важкий_бп',
            'РСЗВ_важкий_дистанційне_мінування_бп',
            'ствольний_середній_протитанковий_бп',
            'ракета_балістична_бп',
            'ракета_крилата_бп',
            'ствольний_середній_касетний_бп',
            'ствольний_середній_дистанційне_мінування_бп',
            'РСЗВ_середній_бп',
            'РСЗВ_легкий_бп',
            'ствольний_важкий_ОФ_бп',
            'ствольний_середній_ОФ_бп',
            'ствольний_легкий_ОФ_бп',
            'мінометний_важкий_бп',
            'мінометний_середній_бп',
            'мінометний_легкий_бп',
            '_227_мм_М30_бп',
            '_227_мм_М30А1А2_бп',
            '_227_мм_М31А1А2_бп',
            '_227_мм_GLSDB_бп',
            '_227_мм_DM72_бп',
            'М982_Excalibur_бп',
            '_610_мм_М39_бп',
            '_610_мм_М48_бп',
            '_610_мм_М57_бп',
            'Р360_Нептун_бп',
            '_155_мм_Bonus_бп',
            '_155_мм_Vulcano_бп',
            '_155_мм_Smart_бп',
            '_155_мм_Coperhed_бп',
            '_155_мм_М864_касетні_бп',
            '_155_мм_М483_касетні_бп',
            '_155_мм_М741_ДМ_бп',
            '_155_мм_М692_ДМ_бп',
            '_155_мм_М731_ДМ_бп',
            '_300_мм__РС_бп',
            '_220_мм_РС_бп',
            '_128_мм_РС_бп',
            '_122_мм_РС_бп',
            '_70_мм_РС_бп',
            '_203_мм_бп',
            '_155_мм_бп',
            '_152_мм_бп',
            '_122_мм_бп',
            '_105_мм_бп',
            '_100_мм_бп',
            '_85_мм_бп',
            '_120_мм_міномети_бп',
            '_82_мм_міномети_бп',
            '_60_мм_міномети_бп',
            '_227_мм_М26_бп',
        ],
    },
    /**
     * Налаштування парсингу/зчитування моделей даних із різних аркушів або таблиць (Excel/Spreadsheet/DB).
     * Визначає початкову позицію клітинки (row, col), напрямок читання, глибину заголовка та обмеження діапазону.
     * 
     * @type {Object<string, {
     *   row: number, // рядок з якого почати брати заголовки
     *   col: string, // колонка з якої почати брати заголовки
     *   direction: boolean, // заголовки: true за рядками, false за колонками
     *   headerDepth: number, // об'єднання заголовків - вказати кількість рядків/колонок для об'єднання значень. рядки - згори в низ, колонки - з ліва на право.
     *   headerDelimiter: string, // розділювач об'єднаних значень
     *   maxCell: string, // адреса нижньої правої комірки (Z20)
     *   maxRow: number, // крайній рядок
     *   maxCol: string  // крайня колонка
     * }>}
     * 
     * Властивість `direction`:
     * - `true`  — Орієнтація по рядках (зчитування виконується горизонтально з рядка).
     * - `false` — Орієнтація по стовпчиках (зчитування виконується вертикально зі стовпчика).
     */
    dbModelsOpt: {
        base: { row: 1, col: 'A', direction: true },
        'ГОЧ': { row: 1, col: 'A', direction: true },
        'Втрати ЗСУ': { row: 1, col: 'A', direction: true },
        'Застосування БК та FPV': { row: 1, col: 'A', direction: true },
        'ОВгП': { row: 1, col: 'A', direction: true },
    },

    dbModelsPrimaries: {
        'ГОЧ': ['Дата', 'Угруповання'],
        'Втрати ЗСУ': ['Дата'],
        'Застосування БК та FPV': ['Дата'],
        'ОВгП': ['Дата', 'Угруповання'],
    },

    xlsSheets: [
        'ГОЧ',
        'Застосування БК та FPV',
        'ОВгП',
        'Втрати ЗСУ',
    ],

    //==========================
    // Charts (ApexCharts Configs)
    //==========================
    chartColors: [
        '#4A90E2','#00A86B','#A1887F', '#5E35B1','#B71C1C',  '#C59B27', '#E64A19', '#0288D1','#2E7D32',
        '#0A74DA',  '#C62828', '#AFB42B',  '#4527A0', '#D84315',
        '#1565C0', '#E6A100', '#1B5E20', '#880E4F', '#6A1B9A', '#BF360C',
        '#0D47A1', '#F57C00', '#4E342E', '#AD1457', '#311B92', 
        '#FBC02D', '#00796B', '#D81B60', '#7B1FA2', '#8D6E63'
    ],
    color: {
        textenemy: '#ff92a2',
        textfriendly: '#6cc0ff',
        friendly: '#008FFB',
        enemy: '#FF4560',

    },

    //==========================
    // Lists & Aggregation Maps
    //==========================

    units: ['uvWest', '12AK', 'uvNorth', /* 'uvKursk', */ 'uOS', 'uvEast', 'uvSouth'],
    unitStructure: {
        uvWest: { name: 'УВ (с) Зх', nameMd: 'УВ (с) "Захід"', squad: [], class: 'box-uv-west' },
        uvEast: {
            name: 'УВ (с) Сх', nameMd: 'УВ (с) "Схід"', squad: ['11 АК', '19 АК', '1 КНГУ "Азов"', /* 'Покровський н.', */ '9 АК'], class: 'box-uv-east' },
        uvNorth: { name: 'УВ (с) Пн', nameMd: 'УВ (с) "Північ"', squad: ['15 АК', '18 АК', '8 КДШВ'], class: 'box-uv-north' },
        uvSouth: { name: 'УВ (с) Пд', nameMd: 'УВ (с) "Південь"', squad: ['20 АК',  'Олександрівський н.', '7 КШР', '17 АК', '30 КМП', 'ОТУ "Одеса"'], class: 'box-uv-south' },
        uOS: { name: 'УОС', nameMd: 'УОС', squad: ['14 АК', '2 КНГУ "Хартія"', '16 АК', '10 АК', '3 АК'], class: 'box-uv-uos' },
        // uvKursk: { name: 'УВ "Курськ"', nameMd: 'УВ "Курськ"', squad: [], class: 'box-uv-kursk' },
        sbu: { name: 'СБУ', nameMd: 'СБУ', squad: [], class: 'box-uv-sbu' },
        uSbps: { name: 'УСБпС', nameMd: 'УСБпС', squad: [], class: 'box-uv-sbps' },
        '12AK': { name: '12 АК', nameMd: '12 АК', squad: [], class: 'box-uv-12ak' },
    },
    unitsKey: 'Угруповання',

    unmSys: ['bbp', 'italmas', 'lancet', 'molniya', 'banderol', 'kub'],
    unmSysConf: {
        bbp: {
            name: 'Шахед/Гербера/Пародія',
            class: 'drone drone-bbp',
            dbKey: 'ШахедиГербераПародія'
        },
        italmas: {
            name: 'Італмас',
            class: 'drone drone-italmas',
            dbKey: 'Італмас'
        },
        lancet: {
            name: 'Ланцет',
            class: 'drone drone-lancet',
            dbKey: 'Ланцет'
        },
        molniya: {
            name: 'Молнія',
            class: 'drone drone-molniya',
            dbKey: 'Молнія'
        },
        banderol: {
            name: 'Бандероль',
            class: 'drone drone-banderol',
            dbKey: 'Бандероль'
        },
        kub: {
            name: 'Привіт/Куб',
            class: 'drone drone-kub',
            dbKey: 'ПривітКуб'
        }
    },

    // Data.global.carouselConfigs (або окремий модуль)
    //TODO: REFACTOR [Data] carouselConfigs треба винести в Data.page
    carouselConfigs: {
        // Стандартна схема (дефолтна) для більшості категорій
        _default: [
            {
                id: 'carusel-content-1',
                tpl: 'carousel-inner',
                activeClass: '',
                titleSuffix: ' (по угрупованням)',
                source: 'unitsViewModel'
            },
            {
                id: 'carusel-content-2',
                tpl: 'carousel-inner',
                activeClass: '',
                titleSuffix: ' (тенденції)',
                source: 'unitsTrendsViewModel'
            },
            {
                id: 'carusel-content-3',
                tpl: 'carousel-inner',
                activeClass: 'two-items',
                titleSuffix: ' (розподіл, тенденція)',
                source: ['radarBigModel', 'totalTrendBigModel']
            }
        ],
    },

    runInterval: false,
    intervalPeriod: 5000,
    intervalTimeout: 15000,
    pageCarousel: {
        interval: 15000,   // Інтервал автоплею в мс
        ride: false, // 'carousel' = запуск одразу, true = запуск після першого кліку
        pause: false,    // 'hover' = пауза при наведенні миші, false = не ставити на паузу
        wrap: true,       // true = безкінечний цикл, false = зупинка на останньому слайді
        touch: true       // дозволити свайпи на тачскрінах
    },

    // Що діставати з localStorage в store (State)
    store: ['activeCategory', 'activeCategoryInd', 'dateFrom', 'dateTo', 'page', 'pageName', 'pageScroll', 'pageSlide', 'prevPageTpl', 'curPageTpl'],

    debag: false,
};

/**
 * Структура сторінки дашборду
 */
Data.page = {
    DashBoard: {
        // Конфігурація відображення сітки віджетів (приклад реалізації)
        layout: ['general_stats', 'charts_grid', 'unit_details'],
        allowedWidgets: ['area_trends', 'radar_distribution', 'opposite_ratio'],


        categories: [
            'Обстріли', 'РУ', 'АУ/КАБ/КАР', 'ШД_всього', 'ШД_тривають', 'Позиції', 'Території', 'Втрати ос', 'БпС противника'
        ],
        categoriesByKey: {
            'Обстріли': 'Обстріли',
            'РУ': 'Застосовано_ракет',//'Ракетні_удари',
            'АУ/КАБ/КАР': ['АУ_', 'КАБ', 'КАР'],
            'ШД': 'Всього_бойових_зіткнень',
            'ШД_всього': ['Бойові_зіткнення', 'Штурмові_дії_',],
            'ШД_тривають': ['Тривають_бз', 'Тривають_шд',],
            'Втрата позицій': 'Всього_втрачено_позицій',
            'Позиції': ['Відновлено_позицій', 'Виставлено_позицій', 'Всього_втрачено_позицій'],
            'Території': ['втрачено_територій','відновлено_територій'],
            'Втрати ос': ['Втрати_всього_ЗСУ', 'Втрати_всього_рф'],
            'БпС противника': 'ВСЬОГО_УДАРІВ_БпЛА',
        },
        //TODO: REFACTOR [Data] повиносити текстовки в Data.text
        categoriesByTitle: {
            'Обстріли': Data.text['Обстріли'],
            'РУ': Data.text['Ракет'],
            'АУ/КАБ/КАР': Data.text['АУ/КАБ/КАР'],
            'АУ_': 'АУ',
            'КАБ': 'КАБ',
            'КАР': 'КАР',
            'ШД': Data.text['ШД'],
            'Втрата позицій': Data.text['Втрата позицій'],
            'Позиції': Data.text['Позиції'],
            'Території': Data.text['Території'],
            'втрачено_територій': Data.text['втрачено'],
            'відновлено_територій': Data.text['відновлено'],
            'відновлено_територій_сумарно': Data.text['відновлено'],
            'втрати_територій_сумарно': Data.text['втрачено'],
            'Втрати ос': Data.text['Втрати ос'],
            'БпС противника': Data.text['БпС противника'],
            'Відновлено_позицій': 'Відновлено',
            'Виставлено_позицій': 'Виставлено',
            'Втрати_всього_ЗСУ': 'Втрати СОУ',
            'Втрати_всього_рф': 'Втрати \u{1F43D}',
            'Всього_втрачено_позицій': 'Втрачено',
            'Бойові_зіткнення': 'СОУ',
            'Тривають_бз': 'СОУ',
            'Штурмові_дії_': "рф \u{1F43D}",
            'Тривають_шд': 'рф \u{1F43D}',
            'ШД_всього': 'Штурмових дій всього',
            'ШД_тривають': 'Штурмові дії трив.',

        },
        categoriesByHeader: {
            'Обстріли': Data.text['Обстріли'],
            'РУ': Data.text['Ракетні удари'],
            'АУ/КАБ/КАР': Data.text['АУ/КАБ/КАР'],
            'ШД': Data.text['ШД'],
            'Втрата позицій': Data.text['Втрата позицій'],
            'Позиції': Data.text['позиції в/в'],
            'Території': Data.text['Території в/в'],
            'Втрати ос': Data.text['Втрати ос'],
            'БпС противника': Data.text['fpv'],
            'ШД_всього': 'Штурмових дій всього',
            'ШД_тривають': 'Штурмові дії тривають',
        },
        categoriesByRelations: {
            'Обстріли': ['ВСЬОГО за СО:'],
            'РУ': ['ВСЬОГО за СО:'],
            'АУ/КАБ/КАР': ['ВСЬОГО за СО:'],
            'ШД': ['ВСЬОГО за СО:'],
            'ШД_всього': ['ВСЬОГО за СО:'],
            'ШД_тривають': ['ВСЬОГО за СО:'],
            'Втрата позицій': ['ВСЬОГО за СО:'],
            'Позиції': ['ВСЬОГО за СО:'],
            'Території': ['ВСЬОГО за СО:'],
            'Втрати ос': ['ВСЬОГО за СО:'],
            'БпС противника': ['ВСЬОГО за СО:'],
        },
        categoriesChartColor: {
            // 'Обстріли': Data.text['Обстріли'],
            // 'РУ': Data.text['Ракетні удари'],
            // 'АУ/КАБ/КАР': Data.text['АУ/КАБ/КАР'],
            // 'АУ_': 'АУ',
            // 'КАБ': 'КАБ',
            // 'КАР': 'КАР',
            // 'ШД': Data.text['ШД'],
            // 'Втрата позицій': Data.text['Втрата позицій'],
            // 'Позиції': Data.text['Позиції'],
            // 'Втрати ос': Data.text['Втрати ос'],
            // 'БпС противника': Data.text['БпС противника'],
            'Відновлено_позицій': '#10B981',
            'Виставлено_позицій': '#ECC94B',
            'Всього_втрачено_позицій': '#FF4560',
            'Втрати_всього_ЗСУ': '#008FFB',
            'відновлено_територій': '#008FFB',
            'втрачено_територій': '#FF4560',
            'Втрати_всього_рф': '#FF4560',
            'Бойові_зіткнення': '#008FFB',
            'Тривають_бз': '#008FFB',
            'Штурмові_дії_': '#FF4560',
            'Тривають_шд': '#FF4560',
            // 'Ш  Д_всього': 'Штурмових дій всього',
            // 'ШД_тривають': 'Штурмові дії трив.',
        },
        carouselConfigs: {
            // Стандартна схема (дефолтна) для більшості категорій

            // Спеціальний конфіг для БпС
            'БпС противника': [
                {
                    id: 'carusel-content-1',
                    tpl: 'carousel-inner',
                    activeClass: '',
                    customTitle: 'Застосування FPV противника',
                    source: 'unitsViewModel'
                },
                {
                    id: 'carusel-content-2',
                    tpl: 'carousel-inner',
                    activeClass: '',
                    customTitle: 'Тенденція застосування FPV противника',
                    source: 'unitsTrendsViewModel'
                },
                {
                    id: 'carusel-content-3',
                    tpl: 'carousel-inner',
                    activeClass: 'two-items',
                    customTitle: 'FPV противника (розподіл, тенденція)',
                    source: ['radarBigModel', 'totalTrendBigModel'] //TODO FIX [Data, Models] треба уніфікувати ці моделі, якщо їх поставити просто окремо ('radarBigModel') то не вантажиться.
                },
                {
                    id: 'carusel-content-4',
                    tpl: 'carousel-inner',
                    activeClass: 'grid-6x2',
                    customTitle: 'Інші БпС противника',
                    source: 'droneTrendsViewModel',
                    // Можемо додавати умови показу слайду!
                    condition: (models) => models.droneTrendsViewModel && models.droneTrendsViewModel.length > 0
                }
            ],

            'Території': [
                {
                    id: 'carusel-content-0',
                    tpl: 'carousel-inner',
                    activeClass: 'box-frontier',
                    customTitle: 'Зміщення переднього краю',
                    source: ['unitTextModel','unitFrontierModel']
                },
                {
                    id: 'carusel-content-1',
                    tpl: 'carousel-inner',
                    activeClass: 'units-slide',
                    customTitle: 'Втрати/відновлення територій',
                    source: 'unitsViewModel'
                },
                {
                    id: 'carusel-content-2',
                    tpl: 'carousel-inner',
                    activeClass: '',
                    customTitle: 'Тенденція втрати/відновлення територій',
                    source: 'unitsTrendsViewModel'
                },
                {
                    id: 'carusel-content-3',
                    tpl: 'carousel-inner',
                    activeClass: 'two-items',
                    customTitle: 'Втрати/відновлення територій (розподіл, тенденція)',
                    source: ['radarBigModel', 'totalTrendBigModel']
                },
            ],

            // Спеціальний конфіг для "ШД_тривають" (лише 1 слайд)
            'ШД_тривають': [
                {
                    id: 'carusel-content-1',
                    tpl: 'carousel-inner',
                    activeClass: '',
                    titleSuffix: ' (по угрупованням)',
                    source: 'unitsViewModel'
                }
            ]
        },
    },
    OVgP: {
        unitsByKeys: {
            'uvWest': ['УВ_с_Захід_вз', 'УВ_с_Захід_бп',],
            '12AK': ['_12_АК_вз', '_12_АК_бп',],
            'uvNorth': ['УВ_с_Північ_вз', 'УВ_с_Північ_бп',],
            'uvKursk': ['УВ_Курськ_вз', 'УВ_Курськ_бп',],
            'uOS': ['УОС_вз', 'УОС_бп',],
            'uvEast': ['УВ_с_Схід_вз', 'УВ_с_Схід_бп',],
            'uvSouth': ['УВ_с_Південь_вз', 'УВ_с_Південь_бп',],
        },

        categories: [
            'Витрати', 'Ракети', 'РСЗВ', 'Ствольна артилерія', 'Міномети', 
        ],
        categoriesByKey: {
            'Витрати': ['всього_вз', 'всього_бп'],
            'Ракети': ['ракета_вз', 'ракета_бп',],
            'РСЗВ': ['РСЗВ_вз', 'РСЗВ_бп',],
            'Ствольна артилерія': ['ствольний_вз', 'ствольний_бп',],
            'Міномети': ['мінометний_вз', 'мінометний_бп',],
        },
        categoriesBySub: {
            'Ствольна артилерія': [
                'ствольний середній протитанковий',
                'ствольний середній касетний',
                'ствольний середній дистанційне мінування',
                'ствольний важкий ОФ',
                'ствольний середній ОФ',
                'ствольний легкий ОФ',
            ],
            'РСЗВ': [
                'РСЗВ важкі',
                'РСЗВ середні',
                'РСЗВ легкі',
                'РСЗВ важкий дистанційне мінування',
            ],
            'Міномети': [
                'Міномети важкі',
                'Міномети середні',
                'Міномети легкі',
            ],
            'Ракети': [
                'Ракети балістичні',
                'Ракети крилаті',
            ],

        },
        subcategories: [
            'РСЗВ важкі',
            'РСЗВ середні',
            'РСЗВ легкі',

            'Міномети важкі',
            'Міномети середні',
            'Міномети легкі',
            'Ракети балістичні',
            'Ракети крилаті',

            'РСЗВ важкий дистанційне мінування',
            'ствольний середній протитанковий',
            'ствольний середній касетний',
            'ствольний середній дистанційне мінування',
            'ствольний важкий ОФ',
            'ствольний середній ОФ',
            'ствольний легкий ОФ',
            
        ],
        subcategoriesByKey: {
            'РСЗВ важкі': ['РСЗВ_важкий_вз', 'РСЗВ_важкий_бп',],
            'РСЗВ середні': ['РСЗВ_середній_вз', 'РСЗВ_середній_бп',],
            'РСЗВ легкі': ['РСЗВ_легкий_вз', 'РСЗВ_легкий_бп',],
            
            'Міномети важкі': ['мінометний_важкий_вз', 'мінометний_важкий_бп',],
            'Міномети середні': ['мінометний_середній_вз', 'мінометний_середній_бп',],
            'Міномети легкі': ['мінометний_легкий_вз', 'мінометний_легкий_бп',],
            'Ракети балістичні': ['ракета_балістична_вз', 'ракета_балістична_бп',],
            'Ракети крилаті': ['ракета_крилата_вз', 'ракета_крилата_бп',],

            'РСЗВ важкий дистанційне мінування': ['РСЗВ_важкий_дистанційне_мінування_вз', 'РСЗВ_важкий_дистанційне_мінування_бп',],
            'ствольний середній протитанковий': ['ствольний_середній_протитанковий_вз', 'ствольний_середній_протитанковий_бп',],
            'ствольний середній касетний': ['ствольний_середній_касетний_вз', 'ствольний_середній_касетний_бп',],
            'ствольний середній дистанційне мінування': ['ствольний_середній_дистанційне_мінування_вз', 'ствольний_середній_дистанційне_мінування_бп',],
            'ствольний важкий ОФ': ['ствольний_важкий_ОФ_вз', 'ствольний_важкий_ОФ_бп',],
            'ствольний середній ОФ': ['ствольний_середній_ОФ_вз', 'ствольний_середній_ОФ_бп',],
            'ствольний легкий ОФ': ['ствольний_легкий_ОФ_вз', 'ствольний_легкий_ОФ_бп',],
           
        },
        subcategoriesByTitle: {
            'Міномети важкі': 'Важка',
            'Міномети середні': 'Середня',
            'Міномети легкі': 'Легка',
            'РСЗВ важкі': 'Важкі',
            'РСЗВ середні': 'Середні',
            'РСЗВ легкі': 'Легкі',
            'Ракети балістичні': 'Балістичні',
            'Ракети крилаті': 'Крилаті',

            'РСЗВ важкий дистанційне мінування': 'дистанційне мінування',
            'ствольний середній протитанковий': 'протитанковий',
            'ствольний середній касетний': 'касетний',
            'ствольний середній дистанційне мінування': 'дистанційне мінування',
            'ствольний важкий ОФ': 'ОФ',
            'ствольний середній ОФ': 'ОФ',
            'ствольний легкий ОФ': 'ОФ',
        },
        subcategoriesByRelations: {
            'Міномети важкі': ['ВСЬОГО за СО:'],
            'Міномети середні': ['ВСЬОГО за СО:'],
            'Міномети легкі': ['ВСЬОГО за СО:'],
            'РСЗВ важкі': ['ВСЬОГО за СО:'],
            'РСЗВ середні': ['ВСЬОГО за СО:'],
            'РСЗВ легкі': ['ВСЬОГО за СО:'],
            'Ракети балістичні': ['ВСЬОГО за СО:'],
            'Ракети крилаті': ['ВСЬОГО за СО:'],

            'РСЗВ важкий дистанційне мінування': ['ВСЬОГО за СО:'],
            'ствольний середній протитанковий': ['ВСЬОГО за СО:'],
            'ствольний середній касетний': ['ВСЬОГО за СО:'],
            'ствольний середній дистанційне мінування': ['ВСЬОГО за СО:'],
            'ствольний важкий ОФ': ['ВСЬОГО за СО:'],
            'ствольний середній ОФ': ['ВСЬОГО за СО:'],
            'ствольний легкий ОФ': ['ВСЬОГО за СО:'],
        },
        //TODO: REFACTOR [Data] повиносити текстовки в Data.text
        categoriesByTitle: {
            'Витрати': 'Витрати',
            'РСЗВ': 'РСЗВ',
            'Дистанційне мінування': 'Дистанційне мінування',
            'Протитанкові': 'Протитанкові',
            'Касетні': 'Касетні',
            'Ствольна артилерія': 'Ствольна артилерія',
            'Міномети': 'Міномети',
            'Ракети': 'Ракетні комплекси',

            'всього_вз': 'Вогневих завдань',
            'всього_бп': 'Боєприпасу',


            'ВСЬОГО_за_СО_вз': 'Вогневих завдань',
            'ВСЬОГО_за_СО_бп': 'Боєприпасу',

            'РСЗВ_вз': 'Вогневих завдань',
            'РСЗВ_бп': 'Боєприпасу',
            
            'РСЗВ_важкий_вз': 'Вогневих завдань',
            'РСЗВ_важкий_бп': 'Боєприпасу',
            
            'РСЗВ_середній_вз': 'Вогневих завдань',
            'РСЗВ_середній_бп': 'Боєприпасу',
            
            'РСЗВ_легкий_вз': 'Вогневих завдань',
            'РСЗВ_легкий_бп': 'Боєприпасу',
            
            'ствольний_вз': 'Вогневих завдань',
            'ствольний_бп': 'Боєприпасу',
            'мінометний_вз': 'Вогневих завдань',
            'мінометний_бп': 'Боєприпасу',
            'ракета_вз': 'Вогневих завдань',
            'ракета_бп': 'Боєприпасу',

            'мінометний_важкий_вз': 'Вогневих завдань',
            'мінометний_важкий_бп': 'Боєприпасу',

            'ракета_балістична_вз': 'Вогневих завдань',
            'ракета_балістична_бп': 'Боєприпасу',
            'ракета_крилата_вз': 'Вогневих завдань',
            'ракета_крилата_бп': 'Боєприпасу',

            'мінометний_середній_вз': 'Вогневих завдань',
            'мінометний_середній_бп': 'Боєприпасу',

            'мінометний_легкий_вз': 'Вогневих завдань',
            'мінометний_легкий_бп': 'Боєприпасу',

            'РСЗВ_важкий_дистанційне_мінування_вз': 'Вогневих завдань',
            'ствольний_середній_протитанковий_вз': 'Вогневих завдань',
            'ствольний_середній_касетний_вз': 'Вогневих завдань',
            'ствольний_середній_дистанційне_мінування_вз': 'Вогневих завдань',
            'ствольний_важкий_ОФ_вз': 'Вогневих завдань',
            'ствольний_середній_ОФ_вз': 'Вогневих завдань',
            'ствольний_легкий_ОФ_вз': 'Вогневих завдань',

            'РСЗВ_важкий_дистанційне_мінування_бп': 'Боєприпасу',
            'ствольний_середній_протитанковий_бп': 'Боєприпасу',
            'ствольний_середній_касетний_бп': 'Боєприпасу',
            'ствольний_середній_дистанційне_мінування_бп': 'Боєприпасу',
            'ствольний_важкий_ОФ_бп': 'Боєприпасу',
            'ствольний_середній_ОФ_бп': 'Боєприпасу',
            'ствольний_легкий_ОФ_бп': 'Боєприпасу',

            '_227_мм_М30_вз': 'Вогневих завдань',
            '_227_мм_М30А1А2_вз': 'Вогневих завдань',
            '_227_мм_М31А1А2_вз': 'Вогневих завдань',
            '_227_мм_GLSDB_вз': 'Вогневих завдань',
            '_227_мм_DM72_вз': 'Вогневих завдань',
            'М982_Excalibur_вз': 'Вогневих завдань',
            '_610_мм_М39_вз': 'Вогневих завдань',
            '_610_мм_М48_вз': 'Вогневих завдань',
            '_610_мм_М57_вз': 'Вогневих завдань',
            'Р360_Нептун_вз': 'Вогневих завдань',
            '_155_мм_Bonus_вз': 'Вогневих завдань',
            '_155_мм_Vulcano_вз': 'Вогневих завдань',
            '_155_мм_Smart_вз': 'Вогневих завдань',
            '_155_мм_Coperhed_вз': 'Вогневих завдань',
            '_155_мм_М864_касетні_вз': 'Вогневих завдань',
            '_155_мм_М483_касетні_вз': 'Вогневих завдань',
            '_155_мм_М741_ДМ_вз': 'Вогневих завдань',
            '_155_мм_М692_ДМ_вз': 'Вогневих завдань',
            '_155_мм_М731_ДМ_вз': 'Вогневих завдань',
            '_300_мм__РС_вз': 'Вогневих завдань',
            '_220_мм_РС_вз': 'Вогневих завдань',
            '_128_мм_РС_вз': 'Вогневих завдань',
            '_122_мм_РС_вз': 'Вогневих завдань',
            '_70_мм_РС_вз': 'Вогневих завдань',
            '_203_мм_вз': 'Вогневих завдань',
            '_155_мм_вз': 'Вогневих завдань',
            '_152_мм_вз': 'Вогневих завдань',
            '_122_мм_вз': 'Вогневих завдань',
            '_105_мм_вз': 'Вогневих завдань',
            '_100_мм_вз': 'Вогневих завдань',
            '_85_мм_вз': 'Вогневих завдань',
            '_120_мм_міномети_вз': 'Вогневих завдань',
            '_82_мм_міномети_вз': 'Вогневих завдань',
            '_60_мм_міномети_вз': 'Вогневих завдань',
            '_227_мм_М26_вз': 'Вогневих завдань',

            '_227_мм_М30_бп': 'Боєприпасу',
            '_227_мм_М30А1А2_бп': 'Боєприпасу',
            '_227_мм_М31А1А2_бп': 'Боєприпасу',
            '_227_мм_GLSDB_бп': 'Боєприпасу',
            '_227_мм_DM72_бп': 'Боєприпасу',
            'М982_Excalibur_бп': 'Боєприпасу',
            '_610_мм_М39_бп': 'Боєприпасу',
            '_610_мм_М48_бп': 'Боєприпасу',
            '_610_мм_М57_бп': 'Боєприпасу',
            'Р360_Нептун_бп': 'Боєприпасу',
            '_155_мм_Bonus_бп': 'Боєприпасу',
            '_155_мм_Vulcano_бп': 'Боєприпасу',
            '_155_мм_Smart_бп': 'Боєприпасу',
            '_155_мм_Coperhed_бп': 'Боєприпасу',
            '_155_мм_М864_касетні_бп': 'Боєприпасу',
            '_155_мм_М483_касетні_бп': 'Боєприпасу',
            '_155_мм_М741_ДМ_бп': 'Боєприпасу',
            '_155_мм_М692_ДМ_бп': 'Боєприпасу',
            '_155_мм_М731_ДМ_бп': 'Боєприпасу',
            '_300_мм__РС_бп': 'Боєприпасу',
            '_220_мм_РС_бп': 'Боєприпасу',
            '_128_мм_РС_бп': 'Боєприпасу',
            '_122_мм_РС_бп': 'Боєприпасу',
            '_70_мм_РС_бп': 'Боєприпасу',
            '_203_мм_бп': 'Боєприпасу',
            '_155_мм_бп': 'Боєприпасу',
            '_152_мм_бп': 'Боєприпасу',
            '_122_мм_бп': 'Боєприпасу',
            '_105_мм_бп': 'Боєприпасу',
            '_100_мм_бп': 'Боєприпасу',
            '_85_мм_бп': 'Боєприпасу',
            '_120_мм_міномети_бп': 'Боєприпасу',
            '_82_мм_міномети_бп': 'Боєприпасу',
            '_60_мм_міномети_бп': 'Боєприпасу',
            '_227_мм_М26_бп': 'Боєприпасу',
        },
        subcategoriesByAmmo: {
            'РСЗВ важкі': [
                '227 мм М26',
                '227 мм М30',
                '227 мм М30А1(А2)',
                '227 мм М31А1(А2)',
                '227 мм GLSDB',
                '300 мм  РС',
                '220 мм РС',
            ],
            'РСЗВ середні': [
                '128 мм РС',
                '122 мм РС',
            ],
            'РСЗВ легкі': ['70 мм РС'],

            'Міномети важкі': ['120 мм міномети'],
            'Міномети середні': ['82 мм міномети'],
            'Міномети легкі': ['60 мм міномети'],
            'Ракети балістичні': [
                '610 мм М39',
                '610 мм М48',
                '610 мм М57',
            ],
            'Ракети крилаті': ['Р-360 "Нептун"'],

            'РСЗВ важкий дистанційне мінування': ['227 мм DM-72'],
            'ствольний середній протитанковий': [
                'М982 Excalibur',
                '155 мм Bonus',
                '155 мм Vulcano',
                '155 мм Smart',
                '155 мм Coperhed',
            ],
            'ствольний середній касетний': [
                '155 мм М864(касетні)',
                '155 мм М483(касетні)',
            ],
            'ствольний середній дистанційне мінування': [
                '155 мм М741(ДМ)',
                '155 мм М692(ДМ)',
                '155 мм М731(ДМ)',
            ],
            'ствольний важкий ОФ': ['203 мм'],
            'ствольний середній ОФ': [
                '155 мм',
                '152 мм',
                '122 мм',
            ],
            'ствольний легкий ОФ': [
                '105 мм',
                '100 мм',
                '85 мм',
            ],

        },
        categoriesByHeader: {
            'Витрати': 'Витрати',
            'РСЗВ': 'РСЗВ',
            'Ствольна артилерія': 'Ствольна артилерія',
            'Міномети': 'Міномети',
            'Ракети': 'Ракетні комплекси',
        },
        categoriesByRelations: { // значення які треба знайти в колонці
            'Витрати': ['ВСЬОГО за СО:'],
            'РСЗВ': ['ВСЬОГО за СО:'],
            'Ствольна артилерія': ['ВСЬОГО за СО:'],
            'Міномети': ['ВСЬОГО за СО:'],
            'Ракети': ['ВСЬОГО за СО:'],
        },
        categoriesChartColor: { //TODO: REFACTOR [Data] Data[page].categoriesChartColor винести всі кольори в одне місце
            'Витрати': '#198754',
            'всього_вз': '#10B981',
            'всього_бп': '#ECC94B',

            'РСЗВ_вз': '#10B981',
            'ракета_вз': '#10B981',
            'ствольний_вз': '#10B981',
            'мінометний_вз': '#10B981',

            'РСЗВ_важкий_вз': '#10B981',
            'ракета_балістична_вз': '#10B981',
            'ракета_крилата_вз': '#10B981',
            'РСЗВ_середній_вз': '#10B981',
            'РСЗВ_легкий_вз': '#10B981',

            'мінометний_важкий_вз': '#10B981',
            'мінометний_середній_вз': '#10B981',
            'мінометний_легкий_вз': '#10B981',
            'РСЗВ_важкий_дистанційне_мінування_вз': '#10B981',
            'ствольний_середній_протитанковий_вз': '#10B981',
            'ствольний_середній_касетний_вз': '#10B981',
            'ствольний_середній_дистанційне_мінування_вз': '#10B981',
            'ствольний_важкий_ОФ_вз': '#10B981',
            'ствольний_середній_ОФ_вз': '#10B981',
            'ствольний_легкий_ОФ_вз': '#10B981',

            'РСЗВ_бп': '#ECC94B',
            'ракета_бп': '#ECC94B',
            'ствольний_бп': '#ECC94B',
            'мінометний_бп': '#ECC94B',
            'РСЗВ_важкий_бп': '#ECC94B',
            'ракета_балістична_бп': '#ECC94B',
            'ракета_крилата_бп': '#ECC94B',
            'РСЗВ_середній_бп': '#ECC94B',
            'РСЗВ_легкий_бп': '#ECC94B',
            
            'мінометний_важкий_бп': '#ECC94B',
            'мінометний_середній_бп': '#ECC94B',
            'мінометний_легкий_бп': '#ECC94B',
            'РСЗВ_важкий_дистанційне_мінування_бп': '#ECC94B',
            'ствольний_середній_протитанковий_бп': '#ECC94B',
            'ствольний_середній_касетний_бп': '#ECC94B',
            'ствольний_середній_дистанційне_мінування_бп': '#ECC94B',
            'ствольний_важкий_ОФ_бп': '#ECC94B',
            'ствольний_середній_ОФ_бп': '#ECC94B',
            'ствольний_легкий_ОФ_бп': '#ECC94B',
        },

        carouselConfigs: {
            // Стандартна схема (дефолтна) для більшості категорій
            _default: [
                {
                    id: 'carusel-content-1',
                    tpl: 'carousel-inner',
                    activeClass: '',
                    titleSuffix: '',
                    source: 'unitsTrendsViewModel'
                },
                {
                    id: 'carusel-content-2',
                    tpl: 'carousel-inner',
                    activeClass: 'two-items',
                    titleSuffix: '',
                    source: ['radarBigModel', 'totalTrendBigModel']
                },
                {
                    id: 'carusel-content-3',
                    tpl: 'carousel-inner',
                    activeClass: 'two-items',
                    titleSuffix: '',
                    source: ['radarBigModel', 'totalTrendBigModel']
                },
                {
                    id: 'carusel-content-4',
                    tpl: 'carousel-inner',
                    activeClass: 'two-items',
                    titleSuffix: '',
                    source: ['radarBigModel', 'totalTrendBigModel']
                }
            ],
            'Витрати': [
                {
                    id: 'carusel-content-1',
                    tpl: 'carousel-inner',
                    activeClass: 'two-items',
                    // subCatKey: 'РСЗВ важкі',
                    // customTitle: ,
                    titleSuffix: ' всього за СОУ',
                    source: ['radarBigModel', 'totalTrendBigModel']
                }
            ],
            'РСЗВ': [
                {
                    id: 'carusel-content-1',
                    tpl: 'carousel-inner',
                    activeClass: 'two-items',
                    subCatKey: 'РСЗВ важкі',
                    // customTitle: ,
                    titleSuffix: ` ${Data.text.OVgP.categoriesByHeader['РСЗВ важкі']}`,
                    source: ['radarBigModel', 'totalTrendBigModel']
                },
                {
                    id: 'carusel-content-2',
                    tpl: 'carousel-inner',
                    activeClass: 'two-items',
                    subCatKey: 'РСЗВ середні',
                    // customTitle: ,
                    titleSuffix: ` ${Data.text.OVgP.categoriesByHeader['РСЗВ середні']}`,
                    source: ['radarBigModel', 'totalTrendBigModel']
                },
                {
                    id: 'carusel-content-3',
                    tpl: 'carousel-inner',
                    activeClass: 'two-items',
                    subCatKey: 'РСЗВ легкі',
                    // customTitle: ,
                    titleSuffix: ` ${Data.text.OVgP.categoriesByHeader['РСЗВ легкі']}`,
                    source: ['radarBigModel', 'totalTrendBigModel']
                },
                {
                    id: 'carusel-content-4',
                    tpl: 'carousel-inner',
                    activeClass: 'two-items',
                    subCatKey: 'РСЗВ важкий дистанційне мінування',
                    // customTitle: ,
                    titleSuffix: ` ${Data.text.OVgP.categoriesByHeader['РСЗВ важкий дистанційне мінування']}`,
                    source: ['radarBigModel', 'totalTrendBigModel']
                },
            ],
            'Ствольна артилерія':[
                {
                    id: 'carusel-content-1',
                    tpl: 'carousel-inner',
                    activeClass: 'two-items',
                    subCatKey: 'ствольний важкий ОФ',
                    // customTitle: ,
                    titleSuffix: ` ${Data.text.OVgP.categoriesByHeader['ствольний важкий ОФ']}`,
                    source: ['radarBigModel', 'totalTrendBigModel']
                },
                {
                    id: 'carusel-content-2',
                    tpl: 'carousel-inner',
                    activeClass: 'two-items',
                    subCatKey: 'ствольний середній ОФ',
                    // customTitle: ,
                    titleSuffix: ` ${Data.text.OVgP.categoriesByHeader['ствольний середній ОФ']}`,
                    source: ['radarBigModel', 'totalTrendBigModel']
                },
                {
                    id: 'carusel-content-3',
                    tpl: 'carousel-inner',
                    activeClass: 'two-items',
                    subCatKey: 'ствольний легкий ОФ',
                    // customTitle: ,
                    titleSuffix: ` ${Data.text.OVgP.categoriesByHeader['ствольний легкий ОФ']}`,
                    source: ['radarBigModel', 'totalTrendBigModel']
                },
                {
                    id: 'carusel-content-3',
                    tpl: 'carousel-inner',
                    activeClass: 'two-items',
                    subCatKey: 'ствольний середній протитанковий',
                    // customTitle: ,
                    titleSuffix: ` ${Data.text.OVgP.categoriesByHeader['ствольний середній протитанковий']}`,
                    source: ['radarBigModel', 'totalTrendBigModel']
                },
                {
                    id: 'carusel-content-3',
                    tpl: 'carousel-inner',
                    activeClass: 'two-items',
                    subCatKey: 'ствольний середній касетний',
                    // customTitle: ,
                    titleSuffix: ` ${Data.text.OVgP.categoriesByHeader['ствольний середній касетний']}`,
                    source: ['radarBigModel', 'totalTrendBigModel']
                },
                {
                    id: 'carusel-content-3',
                    tpl: 'carousel-inner',
                    activeClass: 'two-items',
                    subCatKey: 'ствольний середній дистанційне мінування',
                    // customTitle: ,
                    titleSuffix: ` ${Data.text.OVgP.categoriesByHeader['ствольний середній дистанційне мінування']}`,
                    source: ['radarBigModel', 'totalTrendBigModel']
                },
            ],
            'Міномети':[
                {
                    id: 'carusel-content-1',
                    tpl: 'carousel-inner',
                    activeClass: 'two-items',
                    subCatKey: 'Міномети важкі',
                    // customTitle: ,
                    titleSuffix: ` ${Data.text.OVgP.categoriesByHeader['Міномети важкі']}`,
                    source: ['radarBigModel', 'totalTrendBigModel']
                },
                {
                    id: 'carusel-content-2',
                    tpl: 'carousel-inner',
                    activeClass: 'two-items',
                    subCatKey: 'Міномети середні',
                    // customTitle: ,
                    titleSuffix: ` ${Data.text.OVgP.categoriesByHeader['Міномети середні']}`,
                    source: ['radarBigModel', 'totalTrendBigModel']
                },
                {
                    id: 'carusel-content-3',
                    tpl: 'carousel-inner',
                    activeClass: 'two-items',
                    subCatKey: 'Міномети легкі',
                    // customTitle: ,
                    titleSuffix: ` ${Data.text.OVgP.categoriesByHeader['Міномети легкі']}`,
                    source: ['radarBigModel', 'totalTrendBigModel']
                },
            ],
            'Ракети': [
                {
                    id: 'carusel-content-1',
                    tpl: 'carousel-inner',
                    activeClass: 'two-items',
                    subCatKey: 'Ракети балістичні',
                    titleSuffix: ' балістичні',
                    source: ['radarBigModel', 'totalTrendBigModel']
                },
                {
                    id: 'carusel-content-2',
                    tpl: 'carousel-inner',
                    activeClass: 'two-items',
                    subCatKey: 'Ракети крилаті',
                    titleSuffix: ' крилаті',
                    source: ['radarBigModel', 'totalTrendBigModel']
                },
            ],
        },
    },

};